output/load-test/stress-api-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/stress/api-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/2m00.0s

running (0m02.0s), 01/20 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 01/20 VUs  0m02.0s/2m00.0s

running (0m03.0s), 01/20 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 01/20 VUs  0m03.0s/2m00.0s

running (0m04.0s), 02/20 VUs, 8 complete and 0 interrupted iterations
default   [   3% ] 02/20 VUs  0m04.0s/2m00.0s

running (0m05.0s), 02/20 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 02/20 VUs  0m05.0s/2m00.0s

running (0m06.0s), 02/20 VUs, 14 complete and 0 interrupted iterations
default   [   5% ] 02/20 VUs  0m06.0s/2m00.0s

running (0m07.0s), 03/20 VUs, 18 complete and 0 interrupted iterations
default   [   6% ] 03/20 VUs  0m07.0s/2m00.0s

running (0m08.0s), 03/20 VUs, 24 complete and 0 interrupted iterations
default   [   7% ] 03/20 VUs  0m08.0s/2m00.0s

running (0m09.0s), 03/20 VUs, 27 complete and 0 interrupted iterations
default   [   7% ] 03/20 VUs  0m09.0s/2m00.0s

running (0m10.0s), 03/20 VUs, 33 complete and 0 interrupted iterations
default   [   8% ] 03/20 VUs  0m10.0s/2m00.0s

running (0m11.0s), 04/20 VUs, 37 complete and 0 interrupted iterations
default   [   9% ] 04/20 VUs  0m11.0s/2m00.0s

running (0m12.0s), 04/20 VUs, 42 complete and 0 interrupted iterations
default   [  10% ] 04/20 VUs  0m12.0s/2m00.0s

running (0m13.0s), 04/20 VUs, 50 complete and 0 interrupted iterations
default   [  11% ] 04/20 VUs  0m13.0s/2m00.0s

running (0m14.0s), 05/20 VUs, 57 complete and 0 interrupted iterations
default   [  12% ] 05/20 VUs  0m14.0s/2m00.0s

running (0m15.0s), 05/20 VUs, 66 complete and 0 interrupted iterations
default   [  13% ] 05/20 VUs  0m15.0s/2m00.0s

running (0m16.0s), 05/20 VUs, 74 complete and 0 interrupted iterations
default   [  13% ] 05/20 VUs  0m16.0s/2m00.0s

running (0m17.0s), 06/20 VUs, 83 complete and 0 interrupted iterations
default   [  14% ] 06/20 VUs  0m17.0s/2m00.0s

running (0m18.0s), 06/20 VUs, 90 complete and 0 interrupted iterations
default   [  15% ] 06/20 VUs  0m18.0s/2m00.0s

running (0m19.0s), 06/20 VUs, 99 complete and 0 interrupted iterations
default   [  16% ] 06/20 VUs  0m19.0s/2m00.0s

running (0m20.0s), 06/20 VUs, 108 complete and 0 interrupted iterations
default   [  17% ] 06/20 VUs  0m20.0s/2m00.0s

running (0m21.0s), 07/20 VUs, 115 complete and 0 interrupted iterations
default   [  18% ] 07/20 VUs  0m21.0s/2m00.0s

running (0m22.0s), 07/20 VUs, 122 complete and 0 interrupted iterations
default   [  18% ] 07/20 VUs  0m22.0s/2m00.0s

running (0m23.0s), 07/20 VUs, 131 complete and 0 interrupted iterations
default   [  19% ] 07/20 VUs  0m23.0s/2m00.0s

running (0m24.0s), 08/20 VUs, 138 complete and 0 interrupted iterations
default   [  20% ] 08/20 VUs  0m24.0s/2m00.0s

running (0m25.0s), 08/20 VUs, 146 complete and 0 interrupted iterations
default   [  21% ] 08/20 VUs  0m25.0s/2m00.0s

running (0m26.0s), 08/20 VUs, 152 complete and 0 interrupted iterations
default   [  22% ] 08/20 VUs  0m26.0s/2m00.0s

running (0m27.0s), 09/20 VUs, 159 complete and 0 interrupted iterations
default   [  23% ] 09/20 VUs  0m27.0s/2m00.0s

running (0m28.0s), 09/20 VUs, 167 complete and 0 interrupted iterations
default   [  23% ] 09/20 VUs  0m28.0s/2m00.0s

running (0m29.0s), 09/20 VUs, 173 complete and 0 interrupted iterations
default   [  24% ] 09/20 VUs  0m29.0s/2m00.0s

running (0m30.0s), 09/20 VUs, 178 complete and 0 interrupted iterations
default   [  25% ] 09/20 VUs  0m30.0s/2m00.0s

running (0m31.0s), 10/20 VUs, 187 complete and 0 interrupted iterations
default   [  26% ] 10/20 VUs  0m31.0s/2m00.0s

running (0m32.0s), 10/20 VUs, 197 complete and 0 interrupted iterations
default   [  27% ] 10/20 VUs  0m32.0s/2m00.0s

running (0m33.0s), 10/20 VUs, 197 complete and 0 interrupted iterations
default   [  28% ] 10/20 VUs  0m33.0s/2m00.0s

running (0m34.0s), 10/20 VUs, 207 complete and 0 interrupted iterations
default   [  28% ] 10/20 VUs  0m34.0s/2m00.0s

running (0m35.0s), 10/20 VUs, 216 complete and 0 interrupted iterations
default   [  29% ] 10/20 VUs  0m35.0s/2m00.0s

running (0m36.0s), 11/20 VUs, 217 complete and 0 interrupted iterations
default   [  30% ] 11/20 VUs  0m36.0s/2m00.0s

running (0m37.0s), 11/20 VUs, 227 complete and 0 interrupted iterations
default   [  31% ] 11/20 VUs  0m37.0s/2m00.0s

running (0m38.0s), 11/20 VUs, 230 complete and 0 interrupted iterations
default   [  32% ] 11/20 VUs  0m38.0s/2m00.0s

running (0m39.0s), 11/20 VUs, 232 complete and 0 interrupted iterations
default   [  32% ] 11/20 VUs  0m39.0s/2m00.0s

running (0m40.0s), 11/20 VUs, 243 complete and 0 interrupted iterations
default   [  33% ] 11/20 VUs  0m40.0s/2m00.0s

running (0m41.0s), 11/20 VUs, 252 complete and 0 interrupted iterations
default   [  34% ] 11/20 VUs  0m41.0s/2m00.0s

running (0m42.0s), 12/20 VUs, 254 complete and 0 interrupted iterations
default   [  35% ] 12/20 VUs  0m42.0s/2m00.0s

running (0m43.0s), 12/20 VUs, 254 complete and 0 interrupted iterations
default   [  36% ] 12/20 VUs  0m43.0s/2m00.0s

running (0m44.0s), 12/20 VUs, 266 complete and 0 interrupted iterations
default   [  37% ] 12/20 VUs  0m44.0s/2m00.0s

running (0m45.0s), 12/20 VUs, 268 complete and 0 interrupted iterations
default   [  38% ] 12/20 VUs  0m45.0s/2m00.0s

running (0m46.0s), 12/20 VUs, 280 complete and 0 interrupted iterations
default   [  38% ] 12/20 VUs  0m46.0s/2m00.0s

running (0m47.0s), 12/20 VUs, 280 complete and 0 interrupted iterations
default   [  39% ] 12/20 VUs  0m47.0s/2m00.0s

running (0m48.0s), 12/20 VUs, 287 complete and 0 interrupted iterations
default   [  40% ] 13/20 VUs  0m48.0s/2m00.0s

running (0m49.0s), 13/20 VUs, 292 complete and 0 interrupted iterations
default   [  41% ] 13/20 VUs  0m49.0s/2m00.0s

running (0m50.0s), 13/20 VUs, 292 complete and 0 interrupted iterations
default   [  42% ] 13/20 VUs  0m50.0s/2m00.0s

running (0m51.0s), 13/20 VUs, 299 complete and 0 interrupted iterations
default   [  42% ] 13/20 VUs  0m51.0s/2m00.0s

running (0m52.0s), 13/20 VUs, 305 complete and 0 interrupted iterations
default   [  43% ] 13/20 VUs  0m52.0s/2m00.0s

running (0m53.0s), 13/20 VUs, 305 complete and 0 interrupted iterations
default   [  44% ] 13/20 VUs  0m53.0s/2m00.0s

running (0m54.0s), 13/20 VUs, 313 complete and 0 interrupted iterations
default   [  45% ] 13/20 VUs  0m54.0s/2m00.0s

running (0m55.0s), 14/20 VUs, 318 complete and 0 interrupted iterations
default   [  46% ] 14/20 VUs  0m55.0s/2m00.0s

running (0m56.0s), 14/20 VUs, 324 complete and 0 interrupted iterations
default   [  47% ] 14/20 VUs  0m56.0s/2m00.0s

running (0m57.0s), 14/20 VUs, 327 complete and 0 interrupted iterations
default   [  47% ] 14/20 VUs  0m57.0s/2m00.0s

running (0m58.0s), 14/20 VUs, 332 complete and 0 interrupted iterations
default   [  48% ] 14/20 VUs  0m58.0s/2m00.0s

running (0m59.0s), 14/20 VUs, 332 complete and 0 interrupted iterations
default   [  49% ] 14/20 VUs  0m59.0s/2m00.0s

running (1m00.0s), 15/20 VUs, 340 complete and 0 interrupted iterations
default   [  50% ] 15/20 VUs  1m00.0s/2m00.0s

running (1m01.0s), 15/20 VUs, 346 complete and 0 interrupted iterations
default   [  51% ] 15/20 VUs  1m01.0s/2m00.0s

running (1m02.0s), 15/20 VUs, 346 complete and 0 interrupted iterations
default   [  52% ] 15/20 VUs  1m02.0s/2m00.0s

running (1m03.0s), 15/20 VUs, 356 complete and 0 interrupted iterations
default   [  53% ] 15/20 VUs  1m03.0s/2m00.0s

running (1m04.0s), 15/20 VUs, 358 complete and 0 interrupted iterations
default   [  53% ] 15/20 VUs  1m04.0s/2m00.0s

running (1m05.0s), 15/20 VUs, 371 complete and 0 interrupted iterations
default   [  54% ] 15/20 VUs  1m05.0s/2m00.0s

running (1m06.0s), 15/20 VUs, 371 complete and 0 interrupted iterations
default   [  55% ] 15/20 VUs  1m06.0s/2m00.0s

running (1m07.0s), 16/20 VUs, 372 complete and 0 interrupted iterations
default   [  56% ] 16/20 VUs  1m07.0s/2m00.0s

running (1m08.0s), 16/20 VUs, 381 complete and 0 interrupted iterations
default   [  57% ] 16/20 VUs  1m08.0s/2m00.0s

running (1m09.0s), 16/20 VUs, 383 complete and 0 interrupted iterations
default   [  58% ] 16/20 VUs  1m09.0s/2m00.0s

running (1m10.0s), 16/20 VUs, 393 complete and 0 interrupted iterations
default   [  58% ] 16/20 VUs  1m10.0s/2m00.0s

running (1m11.0s), 16/20 VUs, 400 complete and 0 interrupted iterations
default   [  59% ] 16/20 VUs  1m11.0s/2m00.0s

running (1m12.0s), 17/20 VUs, 401 complete and 0 interrupted iterations
default   [  60% ] 17/20 VUs  1m12.0s/2m00.0s

running (1m13.0s), 17/20 VUs, 409 complete and 0 interrupted iterations
default   [  61% ] 17/20 VUs  1m13.0s/2m00.0s

running (1m14.0s), 17/20 VUs, 409 complete and 0 interrupted iterations
default   [  62% ] 17/20 VUs  1m14.0s/2m00.0s

running (1m15.0s), 17/20 VUs, 423 complete and 0 interrupted iterations
default   [  63% ] 17/20 VUs  1m15.0s/2m00.0s

running (1m16.0s), 17/20 VUs, 424 complete and 0 interrupted iterations
default   [  63% ] 17/20 VUs  1m16.0s/2m00.0s

running (1m17.0s), 17/20 VUs, 426 complete and 0 interrupted iterations
default   [  64% ] 17/20 VUs  1m17.0s/2m00.0s

running (1m18.0s), 17/20 VUs, 426 complete and 0 interrupted iterations
default   [  65% ] 17/20 VUs  1m18.0s/2m00.0s

running (1m19.0s), 18/20 VUs, 442 complete and 0 interrupted iterations
default   [  66% ] 18/20 VUs  1m19.0s/2m00.0s

running (1m20.0s), 18/20 VUs, 443 complete and 0 interrupted iterations
default   [  67% ] 18/20 VUs  1m20.0s/2m00.0s

running (1m21.0s), 18/20 VUs, 443 complete and 0 interrupted iterations
default   [  67% ] 18/20 VUs  1m21.0s/2m00.0s

running (1m22.0s), 18/20 VUs, 461 complete and 0 interrupted iterations
default   [  68% ] 18/20 VUs  1m22.0s/2m00.0s

running (1m23.0s), 18/20 VUs, 461 complete and 0 interrupted iterations
default   [  69% ] 18/20 VUs  1m23.0s/2m00.0s

running (1m24.0s), 19/20 VUs, 461 complete and 0 interrupted iterations
default   [  70% ] 19/20 VUs  1m24.0s/2m00.0s

running (1m25.0s), 19/20 VUs, 461 complete and 0 interrupted iterations
default   [  71% ] 19/20 VUs  1m25.0s/2m00.0s

running (1m26.0s), 19/20 VUs, 479 complete and 0 interrupted iterations
default   [  72% ] 19/20 VUs  1m26.0s/2m00.0s

running (1m27.0s), 19/20 VUs, 479 complete and 0 interrupted iterations
default   [  72% ] 19/20 VUs  1m27.0s/2m00.0s

running (1m28.0s), 19/20 VUs, 479 complete and 0 interrupted iterations
default   [  73% ] 19/20 VUs  1m28.0s/2m00.0s

running (1m29.0s), 19/20 VUs, 485 complete and 0 interrupted iterations
default   [  74% ] 19/20 VUs  1m29.0s/2m00.0s

running (1m30.0s), 19/20 VUs, 498 complete and 0 interrupted iterations
default   [  75% ] 19/20 VUs  1m30.0s/2m00.0s

running (1m31.0s), 20/20 VUs, 498 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  1m31.0s/2m00.0s

running (1m32.0s), 20/20 VUs, 498 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  1m32.0s/2m00.0s

running (1m33.0s), 20/20 VUs, 502 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  1m33.0s/2m00.0s

running (1m34.0s), 20/20 VUs, 504 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  1m34.0s/2m00.0s

running (1m35.0s), 19/20 VUs, 518 complete and 0 interrupted iterations
default   [  79% ] 19/20 VUs  1m35.0s/2m00.0s

running (1m36.0s), 19/20 VUs, 518 complete and 0 interrupted iterations
default   [  80% ] 19/20 VUs  1m36.0s/2m00.0s

running (1m37.0s), 17/20 VUs, 522 complete and 0 interrupted iterations
default   [  81% ] 17/20 VUs  1m37.0s/2m00.0s

running (1m38.0s), 16/20 VUs, 537 complete and 0 interrupted iterations
default   [  82% ] 16/20 VUs  1m38.0s/2m00.0s

running (1m39.0s), 16/20 VUs, 537 complete and 0 interrupted iterations
default   [  83% ] 16/20 VUs  1m39.0s/2m00.0s

running (1m40.0s), 16/20 VUs, 537 complete and 0 interrupted iterations
default   [  83% ] 16/20 VUs  1m40.0s/2m00.0s

running (1m41.0s), 14/20 VUs, 552 complete and 0 interrupted iterations
default   [  84% ] 14/20 VUs  1m41.0s/2m00.0s

running (1m42.0s), 14/20 VUs, 553 complete and 0 interrupted iterations
default   [  85% ] 14/20 VUs  1m42.0s/2m00.0s

running (1m43.0s), 13/20 VUs, 554 complete and 0 interrupted iterations
default   [  86% ] 13/20 VUs  1m43.0s/2m00.0s

running (1m44.0s), 12/20 VUs, 565 complete and 0 interrupted iterations
default   [  87% ] 12/20 VUs  1m44.0s/2m00.0s

running (1m45.0s), 11/20 VUs, 567 complete and 0 interrupted iterations
default   [  87% ] 11/20 VUs  1m45.0s/2m00.0s

running (1m46.0s), 10/20 VUs, 578 complete and 0 interrupted iterations
default   [  88% ] 10/20 VUs  1m46.0s/2m00.0s

running (1m47.0s), 10/20 VUs, 579 complete and 0 interrupted iterations
default   [  89% ] 10/20 VUs  1m47.0s/2m00.0s

running (1m48.0s), 09/20 VUs, 589 complete and 0 interrupted iterations
default   [  90% ] 09/20 VUs  1m48.0s/2m00.0s

running (1m49.0s), 08/20 VUs, 597 complete and 0 interrupted iterations
default   [  91% ] 08/20 VUs  1m49.0s/2m00.0s

running (1m50.0s), 07/20 VUs, 603 complete and 0 interrupted iterations
default   [  92% ] 07/20 VUs  1m50.0s/2m00.0s

running (1m51.0s), 07/20 VUs, 610 complete and 0 interrupted iterations
default   [  92% ] 07/20 VUs  1m51.0s/2m00.0s

running (1m52.0s), 06/20 VUs, 619 complete and 0 interrupted iterations
default   [  93% ] 06/20 VUs  1m52.0s/2m00.0s

running (1m53.0s), 05/20 VUs, 628 complete and 0 interrupted iterations
default   [  94% ] 05/20 VUs  1m53.0s/2m00.0s

running (1m54.0s), 05/20 VUs, 636 complete and 0 interrupted iterations
default   [  95% ] 05/20 VUs  1m54.0s/2m00.0s

running (1m55.0s), 04/20 VUs, 645 complete and 0 interrupted iterations
default   [  96% ] 04/20 VUs  1m55.0s/2m00.0s

running (1m56.0s), 03/20 VUs, 651 complete and 0 interrupted iterations
default   [  97% ] 03/20 VUs  1m56.0s/2m00.0s

running (1m57.0s), 03/20 VUs, 657 complete and 0 interrupted iterations
default   [  98% ] 03/20 VUs  1m57.0s/2m00.0s

running (1m58.0s), 02/20 VUs, 662 complete and 0 interrupted iterations
default   [  98% ] 02/20 VUs  1m58.0s/2m00.0s

running (1m59.0s), 01/20 VUs, 666 complete and 0 interrupted iterations
default   [  99% ] 01/20 VUs  1m59.0s/2m00.0s

running (2m00.0s), 01/20 VUs, 668 complete and 0 interrupted iterations
default   [ 100% ] 01/20 VUs  2m0s


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.05' rate=100.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=1.49s
    ✗ 'p(99)<1500' p(99)=1.99s


  █ TOTAL RESULTS 

    checks_total.......: 4014   33.345392/s
    checks_succeeded...: 83.33% 3345 out of 4014
    checks_failed......: 16.66% 669 out of 4014

    ✗ system/info 200
      ↳  0% — ✓ 0 / ✗ 669
    ✓ health/startup 200
    ✓ auth/login 200
    ✓ devices 200
    ✓ alerts 200
    ✓ work-orders 200

    CUSTOM
    api_latency....................: avg=157.85ms min=240µs med=2.44ms max=2.7s p(90)=490.37ms p(95)=1.19s
    errors.........................: 100.00% 669 out of 669

    HTTP
    http_req_duration..............: avg=246.82ms min=240µs med=3.93ms max=2.7s p(90)=995.05ms p(95)=1.49s
      { expected_response:true }...: avg=281.8ms  min=240µs med=4.99ms max=2.7s p(90)=1.18s    p(95)=1.57s
    http_req_failed................: 14.28%  669 out of 4683
    http_reqs......................: 4683    38.902957/s

    EXECUTION
    iteration_duration.............: avg=2.02s    min=517ms med=1.89s  max=5.3s p(90)=3.78s    p(95)=3.86s
    iterations.....................: 669     5.557565/s
    vus............................: 1       min=1           max=20
    vus_max........................: 20      min=20          max=20

    NETWORK
    data_received..................: 24 MB   201 kB/s
    data_sent......................: 3.3 MB  27 kB/s



running (2m00.4s), 00/20 VUs, 669 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  2m0s
time="2026-06-17T20:36:30+08:00" level=error msg="thresholds on metrics 'errors, http_req_duration' have been crossed"